Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 4)]          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 5)]          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          500         input_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 100)          600         input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          10100       dense[0][0]                      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 100)          10100       dense_4[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          10100       dense_1[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 100)          10100       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100)          10100       dense_2[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 100)          10100       dense_6[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 200)          0           dense_3[0][0]                    
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 200)          40200       concatenate[0][0]                
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 400)          80400       dense_8[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 400)          160400      dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 400)          160400      dense_10[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 400)          160400      dense_11[0][0]                   
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 400)          160400      dense_12[0][0]                   
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 400)          160400      dense_13[0][0]                   
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 400)          160400      dense_14[0][0]                   
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 400)          160400      dense_15[0][0]                   
__________________________________________________________________________________________________
Output_layer (Dense)            (None, 2)            802         dense_16[0][0]                   
==================================================================================================
Total params: 1,305,902
Trainable params: 1,305,902
Non-trainable params: 0
__________________________________________________________________________________________________
